## Target Guided Ordinal Encoding

In [2]:
import pandas as pd

In [3]:
# create a sample dataframe with a categorical and a target variable

df = pd.DataFrame({
    'city':['New york','London','paris','Tokyo','New york','Paris'],
    'price':[200, 150, 300, 250, 180, 320]
})

In [4]:
df.head()

       city  price
0  New york    200
1    London    150
2     paris    300
3     Tokyo    250
4  New york    180

In [5]:
## calculate the mean price for each city
df.groupby('city')['price'].mean()

city
London      150.0
New york    190.0
Paris       320.0
Tokyo       250.0
paris       300.0
Name: price, dtype: float64

In [8]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [9]:
mean_price

{'London': 150.0,
 'New york': 190.0,
 'Paris': 320.0,
 'Tokyo': 250.0,
 'paris': 300.0}

In [10]:
## replace each city with  its mean price
df['city_encoded']=df['city'].map(mean_price)

In [11]:
df

       city  price  city_encoded
0  New york    200         190.0
1    London    150         150.0
2     paris    300         300.0
3     Tokyo    250         250.0
4  New york    180         190.0
5     Paris    320         320.0

In [12]:
import seaborn as sns

In [13]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]